## production: ecr
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 2 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                  NAME                  |
|--------|----------------------------------------|
| add    | `aws_ecr_repository.api`               |
|        | `aws_ecr_repository.document-download` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
15:58:58.849 STDOUT terraform:   + create
15:58:58.849 STDOUT terraform: Terraform will perform the following actions:
15:58:58.849 STDOUT terraform:   # aws_ecr_repository.api will be created
15:58:58.849 STDOUT terraform:   + resource "aws_ecr_repository" "api" {
15:58:58.849 STDOUT terraform:       + arn                  = (known after apply)
15:58:58.849 STDOUT terraform:       + force_delete         = false
15:58:58.849 STDOUT terraform:       + id                   = (known after apply)
15:58:58.849 STDOUT terraform:       + image_tag_mutability = "IMMUTABLE"
15:58:58.849 STDOUT terraform:       + name                 = "notify/api"
15:58:58.849 STDOUT terraform:       + region               = "ca-central-1"
15:58:58.849 STDOUT terraform:       + registry_id          = (known after apply)
15:58:58.849 STDOUT terraform:       + repository_url       = (known after apply)
15:58:58.849 STDOUT terraform:       + tags_all             = (known after apply)
15:58:58.849 STDOUT terraform:       + image_scanning_configuration {
15:58:58.849 STDOUT terraform:           + scan_on_push = true
15:58:58.849 STDOUT terraform:         }
15:58:58.849 STDOUT terraform:     }
15:58:58.849 STDOUT terraform:   # aws_ecr_repository.document-download will be created
15:58:58.850 STDOUT terraform:   + resource "aws_ecr_repository" "document-download" {
15:58:58.850 STDOUT terraform:       + arn                  = (known after apply)
15:58:58.850 STDOUT terraform:       + force_delete         = false
15:58:58.850 STDOUT terraform:       + id                   = (known after apply)
15:58:58.850 STDOUT terraform:       + image_tag_mutability = "IMMUTABLE"
15:58:58.850 STDOUT terraform:       + name                 = "notify/document-download"
15:58:58.850 STDOUT terraform:       + region               = "ca-central-1"
15:58:58.850 STDOUT terraform:       + registry_id          = (known after apply)
15:58:58.850 STDOUT terraform:       + repository_url       = (known after apply)
15:58:58.850 STDOUT terraform:       + tags_all             = (known after apply)
15:58:58.850 STDOUT terraform:       + image_scanning_configuration {
15:58:58.850 STDOUT terraform:           + scan_on_push = true
15:58:58.850 STDOUT terraform:         }
15:58:58.850 STDOUT terraform:     }
15:58:58.850 STDOUT terraform: Plan: 2 to add, 0 to change, 0 to destroy.
15:58:58.850 STDOUT terraform: ─────────────────────────────────────────────────────────────────────────────
15:58:58.850 STDOUT terraform: Saved the plan to: plan.tfplan
15:58:58.850 STDOUT terraform: To perform exactly these actions, run the following command to apply:
15:58:58.850 STDOUT terraform:     terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.api-lambda"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.document-download"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.google-cidr"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.heartbeat"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.pinpoint_to_sqs_sms_callbacks"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.ses_to_sqs_email_callbacks"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.sns_to_sqs_sms_callbacks"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.system_status"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.api_lambda_repository_url"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.google_cidr_repository_url"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.heartbeat_repository_url"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.pinpoint_to_sqs_sms_callbacks_repository_url"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.ses_to_sqs_email_callbacks_repository_url"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.sns_to_sqs_sms_callbacks_repository_url"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.system_status_repository_url"]

35 tests, 19 passed, 16 warnings, 0 failures, 0 exceptions

```

</details>
